export default {
  /** 纯数字   */
  number: /\D/g,
  /** 纯数字  */
  english: /[^a-zA-Z]/g,
  /** 正数和负数  */
  positiveOminus: /[^\d.-]/g,
  /** 纯中文 */
  chinese: /[^\u4e00-\u9fa5]/g,
  /** 两位小数 */
  twoDecimals: /^[0-9]+\.[0-9]{2}$/,
  /** 手机号 */
  phone: /^[1][3,4,5,7,8,9][0-9]{9}$/,
  /** 邮箱 */
  c2: /^([a-zA-Z]|[0-9])(\w|\-)+@[a-zA-Z0-9]+\.([a-zA-Z]{2,4})$/,
  /** 文件 */
  files: /^.*\.(?:jpg|jpeg|png|doc|docx|pdf|xls|xlsx|ppt|pptx|txt)$/i,
  /** 身份证号18位 */
  card: /^([1-6][1-9]|50)\d{4}(18|19|20)\d{2}((0[1-9])|10|11|12)(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
};
